# Dùng SQLite trên Colab

In [ ]:
import sqlite3
connection1 = sqlite3.connect('database1.sqlite')
cursor1 = connection1.cursor()
cursor1.execute("""
CREATE TABLE IF NOT EXISTS PRODUCT(
    ID INTEGER PRIMARY KEY,
    NAME TEXT NOT NULL,
    PRICE INTEGER NOT NULL
);
""")

In [ ]:
cursor1.execute("""
INSERT INTO  PRODUCT(ID, NAME, PRICE)
VALUES
    (1, 'iPhone 15', 18000000),
    (2, 'Galaxy Z-Fold 5', 30000000);
""")
connection1.commit()
import pandas as pd
data1=pd.read_sql_query("SELECT * FROM PRODUCT", connection1)
print(data1)

   ID             NAME     PRICE
0   1        iPhone 15  18000000
1   2  Galaxy Z-Fold 5  30000000

In [ ]:
cursor1.execute("""
UPDATE PRODUCT
SET price =50000000
WHERE 1=1
AND name ='Galaxy Z-Fold 5';
""")
connection1.commit()

data1=pd.read_sql_query("SELECT * FROM PRODUCT", connection1)
print(data1)

   ID             NAME     PRICE
0   1        iPhone 15  18000000
1   2  Galaxy Z-Fold 5  50000000

In [ ]:
cursor1.execute("""
DELETE FROM PRODUCT
WHERE 1=1
AND name= 'iPhone 15';
""")
connection1.commit()

data1=pd.read_sql_query("SELECT * FROM PRODUCT", connection1)
print(data1)

   ID             NAME     PRICE
0   2  Galaxy Z-Fold 5  50000000

In [ ]:
# Sử dụng SQLite trong Python

import sqlite3
connection = sqlite3.connect('database.sqlite')
cursor = connection.cursor()
cursor.execute("""
CREATE TABLE IF NOT EXISTS CUSTOMERS(
    EMAIL TEXT PRIMARY KEY,
    NAME TEXT NOT NULL,
    PHONE TEXT NOT NULL
);
""")

In [ ]:
cursor.execute("""
INSERT INTO  CUSTOMERS(EMAIL, NAME, PHONE)
VALUES
    ('nguyen2@aivietnam.edu.vn', 'Nguyen', '123456789'),
    ('admin2@aivietnam.edu.vn', 'Vinh', '123456789');
""")
connection.commit()

In [ ]:
import pandas as pd
data=pd.read_sql_query("SELECT * FROM CUSTOMERS", connection)
print(data)

                      EMAIL    NAME      PHONE
0   nguyen@aivietnam.edu.vn  Nguyen  123456789
1    admin@aivietnam.edu.vn    Vinh  123456789
2  nguyen1@aivietnam.edu.vn  Nguyen  123456789
3   admin1@aivietnam.edu.vn    Vinh  123456789
4  nguyen2@aivietnam.edu.vn  Nguyen  123456789
5   admin2@aivietnam.edu.vn    Vinh  123456789

In [ ]:
cursor.execute("""
UPDATE CUSTOMERS
SET NAME ='Hoang Nguyen'
WHERE 1=1
AND EMAIL ='nguyen@aivietnam.edu.vn';
""")
connection.commit()

data=pd.read_sql_query("SELECT * FROM CUSTOMERS", connection)
print(data)

                      EMAIL          NAME      PHONE
0   nguyen@aivietnam.edu.vn  Hoang Nguyen  123456789
1    admin@aivietnam.edu.vn          Vinh  123456789
2  nguyen1@aivietnam.edu.vn        Nguyen  123456789
3   admin1@aivietnam.edu.vn          Vinh  123456789
4  nguyen2@aivietnam.edu.vn        Nguyen  123456789
5   admin2@aivietnam.edu.vn          Vinh  123456789

In [ ]:
cursor.execute("""
DELETE FROM CUSTOMERS
WHERE 1=1
AND EMAIL= 'nguyen@aivietnam.edu.vn';
""")
connection.commit()

data=pd.read_sql_query("SELECT * FROM CUSTOMERS", connection)
print(data)

                      EMAIL    NAME      PHONE
0    admin@aivietnam.edu.vn    Vinh  123456789
1  nguyen1@aivietnam.edu.vn  Nguyen  123456789
2   admin1@aivietnam.edu.vn    Vinh  123456789
3  nguyen2@aivietnam.edu.vn  Nguyen  123456789
4   admin2@aivietnam.edu.vn    Vinh  123456789

# connect bằng thư viện MySQL của Python

In [ ]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.2.0-cp311-cp311-manylinux_2_28_x86_64.whl.metadata (6.0 kB)
Downloading mysql_connector_python-9.2.0-cp311-cp311-manylinux_2_28_x86_64.whl (34.0 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 34.0/34.0 MB 50.0 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.2.0

In [ ]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.11/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in /usr/local/lib/python3.11/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.11/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.11/dist-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.11/dist-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.11/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [ ]:

import mysql.connector
connection = mysql.connector.connect(
    host="127.0.0.1",     # Địa chỉ máy chủ MySQL (có thể thay đổi)
    user="root",          # Tài khoản MySQL (thay đổi nếu cần)
    password=" ",  # Mật khẩu MySQL
    database="test",    # Tên cơ sở dữ liệu

)

# # IF NOT EXISTS: Tránh lỗi khi bảng đã tồn tại trong MySQL
cursor = connection.cursor()
cursor.execute("""
CREATE TABLE IF NOT EXISTS PRODUCT (
    ID INT PRIMARY KEY,
    NAME TEXT NOT NULL,
    PRICE TEXT NOT NULL
);
""")

cursor.execute("""
INSERT INTO PRODUCT(ID, NAME, PRICE)
VALUES
    (1, 'iPhone 15', 18000000),
    (2, 'Galaxy Z-Fold 5', 30000000);
""")
connection.commit()

import pandas as pd
data=pd.read_sql_query("SELECT * FROM PRODUCT", connection)
print(data)

In [ ]:
cursor.execute("""
UPDATE PRODUCT
SET price =50000000
WHERE 1=1
AND name ='Galaxy Z-Fold 5';
""")
connection.commit()

data=pd.read_sql_query("SELECT * FROM PRODUCT", connection)
print(data)

In [ ]:
cursor.execute("""
DELETE FROM PRODUCT
WHERE 1=1
AND name ='iPhone 15';
""")
connection.commit()

data=pd.read_sql_query("SELECT * FROM PRODUCT", connection)
print(data)

# THAM KHẢO

In [ ]:
!pip install mysql-connector-python

In [ ]:
import mysql.connector
db = mysql.connector.connect(user = "root", password = "mysql", host="localhost")

print(db)

In [ ]:
query = 'CREATE SCHEMA database_d35_usinglib '
cursor = db.cursor()
cursor.execute(query)

In [ ]:
query = 'CREATE TABLE database_d35_usinglib.PRODUCT(ID INT NOT NULL PRIMARY KEY, NAME TEXT NOT NULL, PRICE INT)'
cursor.execute(query)

In [ ]:
import pandas as pd

query = """
    INSERT INTO database_d35_usinglib.PRODUCT(ID, NAME, PRICE)
    VALUES
    (1, 'IPhone 15', 18000000),
    (2, 'Galaxy Z-5', 30000000)
    """
cursor.execute(query)
db.commit()

query = 'SELECT * FROM database_d35_usinglib.PRODUCT'
data = pd.read_sql_query(query, db)
print(data)

In [ ]:
query = """
    UPDATE database_d35_usinglib.PRODUCT
    SET PRICE = 50000000
    WHERE 1 = 1
    AND NAME = 'Galaxy Z-5'
"""
cursor.execute(query)
db.commit()
query = 'SELECT * FROM database_d35_usinglib.PRODUCT'
data = pd.read_sql_query(query, db)
print(data)

In [ ]:
query = """
    DELETE FROM database_d35_usinglib.PRODUCT
    WHERE 1 = 1
    AND NAME = 'IPhone 15'
"""
cursor.execute(query)
db.commit()
query = 'SELECT * FROM database_d35_usinglib.PRODUCT'
data = pd.read_sql_query(query, db)
print(data)